Revit 2027 API
AdvancedWood.WoodEarlycolorPerlinProf Property
 The property labeled "Profile for earlywood color perlin noise" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodEarlycolorPerlinProf { get; }
Public Shared ReadOnly Property WoodEarlycolorPerlinProf As String
	Get
public:
static property String^ WoodEarlycolorPerlinProf {
	String^ get ();
}
static member WoodEarlycolorPerlinProf : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace